app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights" WHERE "flights"."date" = ? AND "flights"."to" = ? AND "flights"."from" = ?  [["date", Tue, 28 Mar 2017], ["to", "guadalajara"], ["from", "mexico"]]
---
  def index
    data_user = params[:data]
    p data_user
    from = data_user[0]
    to = data_user[1]
    date = data_user[3]
    @passengers = data_user[2].to_i
    @flights_avaiable = Flight.where(date: date, to: to, from: from)

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @passengers = []
    @passengers << params[:passengers].to_i
    flight = Flight.find(params[:id])

INSERT INTO "bookings" ("flight_id", "reservation_number", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["flight_id", 1], ["reservation_number", 9939], ["total", 0.0], ["created_at", 2017-03-28 19:11:03 UTC], ["updated_at", 2017-03-28 19:11:03 UTC]]
INSERT INTO "user_flights" ("user_id", "flight_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["flight_id", 1], ["created_at", 2017-03-28 19:11:03 UTC], ["updated_at", 2017-03-28 19:11:03 UTC]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "juan"], ["email", "juan.com"], ["created_at", 2017-03-28 19:11:03 UTC], ["updated_at", 2017-03-28 19:11:03 UTC]]
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "flights" SET "passengers" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["passengers", 24], ["updated_at", 2017-03-28 19:11:03 UTC], ["id", 1]]
SELECT  "bookings".* FROM "bookings" ORDER BY "bookings"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def create
    array_comprador = []
    array_users = []
    counter = 1
    array_new = []
    b = Booking.create(flight_id: params[:id].to_i, reservation_number: rand(0..10000), total: 0)
    params.each do |key, value|
      name = "bookin" + counter.to_s
      email = "booking" + counter.to_s
      if key == name
         array_new << value
      elsif key == email
         array_new << value
         array_users << array_new
         array_new = []
         counter += 1
      elsif key == "name_c"
        array_comprador << value
      elsif key == "email_c"
        array_comprador << value
        @user = User.create(name: array_comprador[0], email: array_comprador[1])
        flight = Flight.find(params[:id])
        UserFlight.create(user_id: @user.id, flight_id: flight.id)
        passengers = flight.passengers - params[:passengers].to_i
        flight.update(passengers: passengers)
        @booking = Booking.last

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def buy
     @booking = Booking.find(params[:data].to_i)